
dadu=[

["आपकी छांव में बिता हर पल ,जैसे हो कोई सुनहरा कल।,आपके बिना अधूरी है ये जिंदगी, आप ही तो हो मेरे जीवन की बंदगी।"],
["आपके आशीर्वाद से सजी है ये डोली,आपके बिना अधूरी है मेरी हर होली।, आपके स्नेह की छांव में बसी है मेरी दुनिया, आपके बिना अधूरी है मेरी हर खुशी की दुनिया।"],
["आपके साथ बिताए हर पल की है मिठास, आपके बिना अधूरी है मेरी हर आस।, आप ही तो हो मेरे जीवन का आधार,आपके बिना अधूरी है मेरी हर बहार।"],
[" दादा जी, आपसे सीखा मैंने जीवन का हर सबक, आपके बिना अधूरी है मेरी हर एक झलक। आपके साथ बिताए पल हैं अनमोल, आप ही तो हो मेरे जीवन का अनमोल।"],
["आपकी गोद में बिता हर एक पल,जैसे हो कोई प्यारा सा कल।आपके बिना अधूरी है मेरी हर खुशी,आप ही तो हो मेरे जीवन की हर खुशी।"]

]

dadi=[

["आपकी ममता की छांव में बिता हर पल, जैसे हो कोई सुनहरा कल। आपके बिना अधूरी है मेरी हर खुशी, आप ही तो हो मेरे जीवन की हर खुशी।"],
["आपके आशीर्वाद से सजी है मेरी डोली, आपके बिना अधूरी है मेरी हर होली। आपके स्नेह की छांव में बसी है मेरी दुनिया, आपके बिना अधूरी है मेरी हर खुशी की दुनिया।",],
["दादी माँ, आपसे सीखा मैंने जीवन का हर सबक, आपके बिना अधूरी है मेरी हर एक झलक। आपके साथ बिताए पल हैं अनमोल, आप ही तो हो मेरे जीवन का अनमोल।"] ,
["आपकी गोद में बिता हर एक पल, जैसे हो कोई प्यारा सा कल। आपके बिना अधूरी है मेरी हर खुशी, आप ही तो हो मेरे जीवन की हर खुशी।"] ,
["आपके साथ बिताए हर पल की है मिठास, आपके बिना अधूरी है मेरी हर आस। आप ही तो हो मेरे जीवन का आधार, आपके बिना अधूरी है मेरी हर बहार।"]  
]

mom=[

["तेरी मुस्कान का मैं करूँ इतना दीदार, जैसे फूलों को मिले हवा का प्यार। तेरी बातों में छुपा है सुरूर, तू मेरी ज़िंदगी का है एक हसीं ख्वाब।"],
["आपकी ममता की छांव में बिता हर पल, जैसे हो कोई सुनहरा कल। आपके बिना अधूरी है मेरी हर खुशी, आप ही तो हो मेरे जीवन की हर खुशी।"],
["आपकी गोद में बिता हर एक पल, जैसे हो कोई प्यारा सा कल। आपके बिना अधूरी है मेरी हर खुशी, आप ही तो हो मेरे जीवन की हर खुशी।"] ,
["आपके स्नेह से सजी है हमारी डोली, आपके बिना अधूरी है हर एक होली। आप ही तो हो हमारे जीवन की शान, आपके बिना अधूरी है हर एक अरमान।"] ,
["आपके आने से घर में आई है रौनक, आपके बिना अधूरी है हर एक चाहत। आप ही तो हो हमारे जीवन की बहार, आपके बिना अधूरी है हर एक प्यार।"]  
]

dad=[

["तेरी बाहों में मिलता है सुकून, तू मेरी ज़िंदगी का है सबसे प्यारा इलाज। तेरी हर मुसीबत को करूँ मैं अपने ऊपर हक, तू मेरी ज़िंदगी का है सबसे बड़ा साथी।"],
["आपकी ममता की छांव में बिता हर पल, जैसे हो कोई सुनहरा कल। आपके बिना अधूरी है मेरी हर खुशी, आप ही तो हो मेरे जीवन की हर खुशी।"],
["आपकी गोद में बिता हर एक पल, जैसे हो कोई प्यारा सा कल। आपके बिना अधूरी है मेरी हर खुशी, आप ही तो हो मेरे जीवन की हर खुशी।"],
["तुम्हारी मेहनत और लगन पर है हमें नाज़, तुम्हारे बिना अधूरी है हमारी हर आवाज़। तुम ही तो हो हमारे जीवन का आधार, तुम्हारे बिना अधूरी है हमारी हर बहार।"],
["तुम्हारी ममता की छांव में बिता हर पल, जैसे हो कोई सुनहरा कल। तुम्हारे बिना अधूरी है मेरी हर खुशी, तुम ही तो हो मेरे जीवन की हर खुशी।"]
]

tiya=[

["तेरे साथ बिताए हर पल की है मिठास, तेरे बिना अधूरी है मेरी हर आस। तू ही तो है मेरे जीवन का आधार, तेरे बिना अधूरी है मेरी हर बहार।"],
["तुम्हारी मुस्कान में बसी है मेरी दुनिया, तुम्हारे बिना अधूरी है मेरी हर खुशी। तुम ही तो हो मेरे जीवन की रौनक, तुम्हारे बिना अधूरी है मेरी हर चाहत।"],
["तुम्हारी ममता की छांव में बिता हर पल, जैसे हो कोई सुनहरा कल। तुम्हारे बिना अधूरी है मेरी हर खुशी, तुम ही तो हो मेरे जीवन की हर खुशी।"],
["तेरी हंसी में बसी है मेरी दुनिया, तेरे बिना अधूरी है मेरी हर खुशी। तू ही तो है मेरे जीवन की रौनक, तेरे बिना अधूरी है मेरी हर चाहत।"],
["तेरी मासूमियत में बसी है मेरी हर खुशी, तेरे बिना अधूरी है मेरी हर खुशी। तू ही तो है मेरे जीवन की बहार, तेरे बिना अधूरी है मेरी हर प्यार।"]    
]

me=[

["तेरी सफलता में बसी है मेरी खुशी, तेरे बिना अधूरी है मेरी हर खुशी। तू ही तो है मेरे जीवन का सितारा, तेरे बिना अधूरी है मेरी हर बहार।"],
["तेरी हंसी में बसी है मेरी दुनिया, तेरे बिना अधूरी है मेरी हर खुशी। तू ही तो है मेरे जीवन की रौनक, तेरे बिना अधूरी है मेरी हर चाहत।"],
["तेरी मेहनत और लगन पर है हमें गर्व, तेरे बिना अधूरी है हमारी हर पर्व। तू ही तो है हमारे जीवन का सितारा, तेरे बिना अधूरी है हमारी हर बहार।"],
["तेरी हंसी में बसी है मेरी दुनिया, तेरे बिना अधूरी है मेरी हर खुशी। तू ही तो है मेरे जीवन की रौनक, तेरे बिना अधूरी है मेरी हर चाहत।"],
["तेरे साथ बिताए हर पल की है मिठास, तेरे बिना अधूरी है मेरी हर आस। तू ही तो है मेरे जीवन का आधार, तेरे बिना अधूरी है मेरी हर प्यार।"]
] 

print("Sheron-shayari")
print("***************")
name=input("Enter your name: ").lower()
print("***************")
des=print("Name info: Prem, Vidhyut, Piyush, Ranu, Aadi, Tiya")
print("***************")
to=input("Whom do you want to write shayari to or enter quit:").lower()

is_running=True
if to == "quit":
    is_running=False

while is_running:
    

    if "prem" in to:
        if name=="aadi":
            print(dadu[3])
        elif name == "tiya":
            print(dadu[4]) 
        elif name == "piyush" or "abhishek":
            print(dadu[0])  
        elif name == "ranu":
            print(dadu[1]) 
        elif name == "vidhyut":
            print(dadu[2])  
             


    if "vidhyut" in to:
        if name=="aadi":
            print(dadi[2])
        elif name == "tiya":
            print(dadi[3]) 
        elif name == "piyush" or "abhishek":
            print(dadi[0])  
        elif name == "ranu":
            print(dadi[1]) 
        elif name == "prem":
            print(dadi[4])   


    if "piyush" in to:
        if name=="aadi":
            print(dad[1])
        elif name == "tiya":
            print(dad[2]) 
        elif name == "vidhyut":
            print(dad[4])  
        elif name == "ranu":
            print(dad[0]) 
        elif name == "prem":
            print(dad[3])       
        
    if "ranu" in to:
        if name=="aadi":
            print(mom[1])
        elif name == "tiya":
            print(mom[2]) 
        elif name == "vidhyut":
            print(mom[3])  
        elif name == "piyush" or "abhishek":
            print(mom[0]) 
        elif name == "prem":
            print(mom[4]) 

    if "aadi" in to:
        if name=="ranu":
            print(me[3])
        elif name == "tiya":
            print(me[4]) 
        elif name == "vidhyut":
            print(me[1])  
        elif name == "piyush" or "abhishek":
            print(me[2]) 
        elif name == "prem":
            print(me[0]) 

    if "tiya" in to:
        if name=="ranu":
            print(tiya[2])
        elif name == "aadi":
            print(tiya[0]) 
        elif name == "vidhyut":
            print(tiya[4])  
        elif name == "piyush" or "abhishek":
            print(tiya[1]) 
        elif name == "prem":
            print(tiya[3])

    if name == to:
        print("You cannot write to yourself")
    
    print("***************")
    name=input("Enter your name: ").lower()
    print("***************")
    des=print("Name info: Prem, Vidhyut, Piyush, Ranu, Aadi, Tiya")
    print("***************")
    to=input("Whom do you want to write shayari to or enter quit:").lower()
if to == "quit":
    is_running=False
